# print("Hello"*3)

# print("Hello, {}".format("World"))

# greeting = "Привет, Артем!"

# name = greeting[greeting.index("А"):greeting.index("!")]

# print(name)

# array = [1,2,3,4,5,6,7,8,9]

# first_two = array[0:2]
# print(first_two)

# Задание 1

# name = "Чехов"
# for i in range(0, len(name)):
#     print(name[i])

# Задание 2

# first = input()
# second = input()

# print("Вчера я написал {}. Вчера я ходил в {}!".format(first, second))

# # Задание 3

# string = "олдос хаксли родился в 1894 году."
# new_string = string.capitalize()
# print(new_string)


# Задание 4

# string = "Где это? Кто это? Когда это?"
# print(string.split("?"))

# Задание 5

# list = ["Рыжая", "fox", "jumped", "over", "low", "gate", "."]
# new_list = " ".join(list)
# print(new_list[0:-2]+".")

# Задание 6
# string = "Ребенок - зеркало поступков родителей"
# print(string.replace("о","0"))

# Задание 7

# word = "Хемингуэй"
# print(word.index("м"))

# Задание 8
# dialog = """

# 'Привет', сказал кто-то
# 'Как твои дела?'
# Не знаю , как твои? 
# Пока

# """
# print(dialog.strip())

# Задание 9
# print("три"+"три"+"три")
# print("три"*3)
 
# Задание 10

# string = "И незачем так орать! Я и в первый раз прекрасно слышал."

# print(string[:string.index("!")])
