# # Это код на пайтон

# name = "Artem"

# if name == "Artem":
#     print("Hello, Artem!")
# else:
#     print("Hello, i dont't know you")

# Задание 1
# print("Hi")
# print("Artem")
# print("How are you")

# # Задание 2
# x = 20

# if x < 10:
#     print("Your number is lower than 10")
# else: 
#     print("Your number is greater or equal to 10")

# Задание 3
# number = 10

# if number <= 10:
#     print("Number under or equal 10")
# elif number <= 25:
#     print("Number under or equal 25")
# else:
#     print("Number greater than 25")


# Задание 4
first = 21
second = 4

print(21/4, "результат деления с плавающеей запятой")
print(21//4, "результат деления в целых")
print(21%4, "остаток от деления")



# Задание 5



# Задание 6
